AixcelStudio/Aixcel_Mini_Drive_Board/Aixcel_Mini_Drive_Board_HW_Check/AT32F403ACGT7_IAR/Src/hwconf.c
/*
******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2022 Aixcel Co.,Ltd</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Aixcel nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "hwconf.h"
#include "systick.h"

#ifdef USART1_ENABLE
uint8_t  USART1_Rx_Mem_Region[USART1_RX_BUF_CELL_CNT * USART1_RX_BUF_CELL_SIZE];
uint8_t  USART1_Tx_Mem_Region[USART1_TX_BUF_CELL_CNT * USART1_TX_BUF_CELL_SIZE];
#endif

#ifdef USART2_ENABLE
uint8_t  USART2_Rx_Mem_Region[USART2_RX_BUF_CELL_CNT * USART2_RX_BUF_CELL_SIZE];
uint8_t  USART2_Tx_Mem_Region[USART2_TX_BUF_CELL_CNT * USART2_TX_BUF_CELL_SIZE];
#endif

#ifdef USART3_ENABLE
uint8_t  USART3_Rx_Mem_Region[USART3_RX_BUF_CELL_CNT * USART3_RX_BUF_CELL_SIZE];
uint8_t  USART3_Tx_Mem_Region[USART3_TX_BUF_CELL_CNT * USART3_TX_BUF_CELL_SIZE];
#endif

#ifdef UART4_ENABLE
uint8_t  UART4_Rx_Mem_Region[UART4_RX_BUF_CELL_CNT * UART4_RX_BUF_CELL_SIZE];
uint8_t  UART4_Tx_Mem_Region[UART4_TX_BUF_CELL_CNT * UART4_TX_BUF_CELL_SIZE];
#endif

#ifdef UART5_ENABLE
uint8_t  UART5_Rx_Mem_Region[UART5_RX_BUF_CELL_CNT * UART5_RX_BUF_CELL_SIZE];
uint8_t  UART5_Tx_Mem_Region[UART5_TX_BUF_CELL_CNT * UART5_TX_BUF_CELL_SIZE];
#endif

static bool     System_Power_Flag            =    false;
static bool     System_Key_Down_Flag         =    false;
static uint32_t System_Key_Down_Record_Time  =    0;

void gpio_init(GPIO_Type* GPIOx, GPIOMode_Type GPIO_Mode, GPIOMaxSpeed_Type GPIO_MaxSpeed, uint16_t GPIO_Pins)
{
    GPIO_InitType GPIO_InitStructure;
    
    GPIO_StructInit(&GPIO_InitStructure);
    GPIO_InitStructure.GPIO_Pins  = GPIO_Pins;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode;
    GPIO_InitStructure.GPIO_MaxSpeed = GPIO_MaxSpeed;
    
    GPIO_Init(GPIOx, &GPIO_InitStructure);
}

/*
 * STM32F103/GD32F103的PC13 PC14 PC15脚如果希望作为普通IO使用需要一些额外的操作, AT32F403A和GD32F303则不需要！！！
 */
void System_GPIO_Init(void)
{
    /* GPIO Ports Clock Enable */    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_AFIO, ENABLE);
    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOA, ENABLE);
    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOB, ENABLE);
    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOC, ENABLE);
    
    /*允许修改RTC和后备寄存器*/
    //PWR_BackupAccessCtrl(ENABLE);

    /*关闭外部低速外部时钟信号功能，PC14 PC15才可以当普通IO用*/
    //RCC_LSEConfig(RCC_LSE_DISABLE);

    /*关闭入侵检测功能，PC13才当普通IO使用*/
    //BKP_TamperPinCmd(DISABLE);

    /*禁止修改后备寄存器*/
    //PWR_BackupAccessCtrl(DISABLE);

    /* NOJTAG: JTAG-DP Disabled and SW-DP Enabled */
    GPIO_PinsRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);  //此语句保留SWD调试功能，禁用JTAG调试，使得被JTAG功能占用的PA15、PB3、PB4释放出来作普通IO
    //GPIO_PinsRemapConfig(GPIO_Remap_SWJ_AllDisable, ENABLE); //此语句会使PA13、PA14、PA15、PB3、PB4全部当作普通IO口使用，导致SWD功能导致无法使用，除非从串口烧录新的删除了这句话的程序SWD功能才能重新启用
    //GPIO_PinsRemapConfig(GPIO_Remap_SWJ_NoJNTRST, ENABLE);   //PB4(USB_RENUM)默认是NJTRST，默认不能做普通IO口使用，此语句会使PB4当作普通IO口使用并保留SWD和JTAG调试功能
    
    /* Configure GPIO pin Output Level */
    GPIO_ResetBits(MCU_TIO1_GPIO_Port, MCU_TIO1_Pin);
    
    GPIO_ResetBits(MCU_TIO2_GPIO_Port, MCU_TIO2_Pin);
    
    GPIO_ResetBits(MCU_AIO1_GPIO_Port, MCU_AIO1_Pin);
    
    GPIO_ResetBits(MCU_AIO2_GPIO_Port, MCU_AIO2_Pin);
    
    GPIO_SetBits(EMG_SIG_GPIO_Port, EMG_SIG_Pin);
    
    GPIO_SetBits(BKP_SIG_GPIO_Port, BKP_SIG_Pin);
    
    GPIO_SetBits(PWR_SIG_GPIO_Port, PWR_SIG_Pin);
    
    GPIO_ResetBits(SPI1_CS_GPIO_Port, SPI1_CS_Pin);
    
    GPIO_ResetBits(SPI2_CS_GPIO_Port, SPI2_CS_Pin);
    
    GPIO_ResetBits(M485_DE_GPIO_Port, M485_DE_Pin);
    
    GPIO_ResetBits(ESP32_EN_GPIO_Port, ESP32_EN_Pin);
    
    GPIO_ResetBits(IMU_INT1_GPIO_Port, IMU_INT1_Pin);
    
    GPIO_SetBits(SYS_LED_GPIO_Port, SYS_LED_Pin);

    /* Configure GPIO pin */
    gpio_init(MCU_TIO1_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, MCU_TIO1_Pin);
    
    gpio_init(MCU_TIO2_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, MCU_TIO2_Pin);
    
    gpio_init(MCU_AIO1_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, MCU_AIO1_Pin);
    
    gpio_init(MCU_AIO2_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, MCU_AIO2_Pin);
    
    gpio_init(EMG_SIG_GPIO_Port, GPIO_Mode_OUT_PP/*GPIO_Mode_IN_FLOATING*/, GPIO_MaxSpeed_50MHz, EMG_SIG_Pin);
    
    gpio_init(BKP_SIG_GPIO_Port, GPIO_Mode_OUT_PP/*GPIO_Mode_IN_FLOATING*/, GPIO_MaxSpeed_50MHz, BKP_SIG_Pin);
    
    gpio_init(PWR_SIG_GPIO_Port, GPIO_Mode_OUT_PP/*GPIO_Mode_IN_FLOATING*/, GPIO_MaxSpeed_50MHz, PWR_SIG_Pin);
    
    gpio_init(SPI1_CS_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, SPI1_CS_Pin);
    
    gpio_init(SPI2_CS_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, SPI2_CS_Pin);
    
    gpio_init(M485_DE_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, M485_DE_Pin);
    
    gpio_init(ESP32_EN_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, ESP32_EN_Pin);
    
    gpio_init(IMU_INT1_GPIO_Port, GPIO_Mode_IN_FLOATING, GPIO_MaxSpeed_50MHz, IMU_INT1_Pin);
    
    gpio_init(SYS_LED_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, SYS_LED_Pin);
}

/**
  * @brief  USB GPIO initialize
  *         USB use DP->PA12, DM->PA11    
  * @param  None
  * @retval None
  */
void System_USB_GPIO_init()
{
    GPIO_InitType GPIO_InitStructure;
    /* Enable the USB Clock*/
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOA, ENABLE);

    /*Configure DP, DM pin as GPIO_Mode_OUT_PP*/
    GPIO_StructInit(&GPIO_InitStructure);
    GPIO_InitStructure.GPIO_Pins  = USB_DP_PIN | USB_DM_PIN;
  #if !defined (AT32F421xx)
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT_PP;
  #else
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OutType = GPIO_OutType_PP;
    GPIO_InitStructure.GPIO_Pull = GPIO_Pull_NOPULL;
  #endif
    GPIO_InitStructure.GPIO_MaxSpeed = GPIO_MaxSpeed_50MHz;
    GPIO_Init(USB_GPIO, &GPIO_InitStructure);
    GPIO_ResetBits(USB_GPIO, USB_DP_PIN);
}

