AixcelStudio/Aixcel_Mini_Drive_Board/Aixcel_Mini_Drive_Board_HW_Check/AT32F403ACGT7_IAR/Src/hwconf.c
    /* disable DMA1 channel2 */
    DMA_ChannelEnable(DMA1_Channel2, DISABLE);               //Caution: Not enable DMA_Channel during init process, Only enable DMA_Channel while receive/transmmit data using DMA !!!
  #endif
}
#endif

void USART2_EN_M485_Tx(void)
{
    M485_DE_Pin_PULL_UP();
}

void USART2_EN_M485_Rx(void)
{
    M485_DE_Pin_PULL_DOWN();
}

void USB_CDC_USART_Init(uint32_t baud_rate)
{
    ;
}

void System_TMR1_Init(void)
{
    /* For AT32F4xx TIMER1,8,9,10,11 is at APB2(APB2_Fmax = 120MHz while CK_AHB = 240MHz & APB2 prescale = 2), 
     * but if(APB2 prescale = 1) CK_TIMERx = APB2, else CK_TIMERx = APB2*2, while APB2 = 120MHZ then CK_TIMERx = 240MHz,
     * if TIMER1's prescaler = 239, then TIMER1's clock is 240MHz/(1+239)=1MHz, 1MHz / 322 = 3.1KHz,
     * while APB2_Fmax = 100MHz & CK_AHB = 200MHz,
     * CK_TIMERx = 200MHz, if TIMER1's prescaler = 199, then TIMER1's clock is 200MHz/(1+199)=1MHz, 1MHz / 322 = 3.1KHz
     */
    TMR_OCInitType TMR_OCInitStruct;
    TMR_TimerBaseInitType TMR_TimeBaseInitStruct;	
    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOA, ENABLE);
    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_TMR1, ENABLE);
    
    gpio_init(BEEP_CTRL_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, BEEP_CTRL_Pin);
    
    TMR_Reset(TMR1);
    
    /* TIMER1 configuration */
    TMR_TimeBaseInitStruct.TMR_DIV               = 239;
    TMR_TimeBaseInitStruct.TMR_Period            = 322-1;
    TMR_TimeBaseInitStruct.TMR_ClockDivision     = TMR_CKD_DIV1;
    TMR_TimeBaseInitStruct.TMR_RepetitionCounter = 0;
    
    TMR_TimeBaseInit(TMR1, &TMR_TimeBaseInitStruct);
    
    TMR_CounterModeConfig(TMR1, TMR_CounterDIR_Up);
    
    /* CH1 configuration in PWM mode1, duty cycle (pwm)/322 */
    TMR_OCInitStruct.TMR_OCMode       = TMR_OCMode_PWM1;
    TMR_OCInitStruct.TMR_OutputState  = TMR_OutputState_Enable;
    TMR_OCInitStruct.TMR_OutputNState = TMR_OutputNState_Disable;
    TMR_OCInitStruct.TMR_Pulse        = 0;
    TMR_OCInitStruct.TMR_OCPolarity   = TMR_OCPolarity_High;
    TMR_OCInitStruct.TMR_OCNPolarity  = TMR_OCNPolarity_High;
    TMR_OCInitStruct.TMR_OCIdleState  = TMR_OCIdleState_Reset;
    TMR_OCInitStruct.TMR_OCNIdleState = TMR_OCNIdleState_Reset;
    
    TMR_OC1Init(TMR1, &TMR_OCInitStruct);
    
    TMR_CtrlPWMOutputs(TMR1, ENABLE);
    
    TMR_OC1PreloadConfig(TMR1, TMR_OCPreload_Enable);

    /* auto-reload preload enable */
    TMR_ARPreloadConfig(TMR1, ENABLE);
    
    /* tmr enable */
    TMR_Cmd(TMR1, ENABLE);
}

/* 
 * STM32F103/GD32F103/GD32F303/AT32F403A系列MCU的通用定时2/3/4/5的捕获/比较寄存器有效宽度都是16位，可以按半字（16位）或字（32位）访问，
 * STM32F429通用定时2/3/4/5的捕获/比较寄存器有效宽度都是32位，其中高16位对于 TIM2 和 TIM5，当通过DMA向STM32F429通用定时３/4的捕获/比较寄存器
 * 搬运数据时可以按半字（16位）或字（32位）访问，当通过DMA向STM32F429通用定时2/5的捕获/比较寄存器搬运数据时只可以按字（32位）访问，即内存中
 * 待搬运的数据留必须以字（32位）为单位排布，如果将内存中的字节或者半字（16位）向通用定时2/5的捕获/比较寄存器搬运，那么先到的数据填充32位寄
 * 存器的低位，后到数据填充32位寄存器的高位，这样会导致PWM输出远远偏离预想的效果！！！
 */
void System_TMR2_Init(void)
{
    /* For AT32F4xx TIMER2,3,4,5,6,7,12,13,14 is at APB1(APB1_Fmax = 120MHz while CK_AHB = 240MHz & APB1 prescale = 2), 
     * but if(APB1 prescale = 1) CK_TIMERx = APB1, else CK_TIMERx = APB1*2, while APB1 = 120MHZ then CK_TIMERx = 240MHz,
     * if TIMER2's prescaler = 1, then TIMER2's clock is 240MHz/(1+1)=120MHz, 120MHz / 150 = 800KHz,
     * while APB1_Fmax = 100MHz & CK_AHB = 200MHz,
     * CK_TIMERx = 200MHz, if TIMER2's prescaler = 1, then TIMER2's clock is 200MHz/(1+1)=100MHz, 100MHz / 125 = 800KHz
     */
    TMR_OCInitType TMR_OCInitStruct;
    TMR_TimerBaseInitType TMR_TimeBaseInitStruct;	
    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOB, ENABLE);
    
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_TMR2, ENABLE);
    
    gpio_init(MCU_TIO1_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, MCU_TIO1_Pin);
    gpio_init(MCU_TIO2_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, MCU_TIO2_Pin);
    
    TMR_Reset(TMR2);
    
    /* TIMER2 configuration */
    TMR_TimeBaseInitStruct.TMR_DIV               = 1;
    TMR_TimeBaseInitStruct.TMR_Period            = 150-1;
    TMR_TimeBaseInitStruct.TMR_ClockDivision     = TMR_CKD_DIV1;
    TMR_TimeBaseInitStruct.TMR_RepetitionCounter = 0;
    
    TMR_TimeBaseInit(TMR2, &TMR_TimeBaseInitStruct);
    
    TMR_CounterModeConfig(TMR2, TMR_CounterDIR_Up);
    
    /* CH configuration in PWM mode1, duty cycle (pwm)/150 */
    TMR_OCInitStruct.TMR_OCMode       = TMR_OCMode_PWM1;
    TMR_OCInitStruct.TMR_OutputState  = TMR_OutputState_Enable;
    TMR_OCInitStruct.TMR_OutputNState = TMR_OutputNState_Disable;
    TMR_OCInitStruct.TMR_Pulse        = 75;
    TMR_OCInitStruct.TMR_OCPolarity   = TMR_OCPolarity_High;
    TMR_OCInitStruct.TMR_OCNPolarity  = TMR_OCNPolarity_High;
    TMR_OCInitStruct.TMR_OCIdleState  = TMR_OCIdleState_Reset;
    TMR_OCInitStruct.TMR_OCNIdleState = TMR_OCNIdleState_Reset;
    
    TMR_OC1Init(TMR2, &TMR_OCInitStruct);
    TMR_OC2Init(TMR2, &TMR_OCInitStruct);
    
    TMR_CtrlPWMOutputs(TMR2, ENABLE);
    
    TMR_OC1PreloadConfig(TMR2, TMR_OCPreload_Enable);
    TMR_OC2PreloadConfig(TMR2, TMR_OCPreload_Enable);

    /* auto-reload preload enable */
    TMR_ARPreloadConfig(TMR2, ENABLE);
    
    /* tmr enable */
    TMR_Cmd(TMR2, ENABLE);
    
    TMR_DMACmd(TMR2, TMR_DMA_CC1, ENABLE);
    TMR_DMACmd(TMR2, TMR_DMA_CC2, ENABLE);
    
    /**************************************************************************/
    
    DMA_InitType DMA_InitStruct;
    
    /* initialize DMA1 channel5 --> TMR2_CH1 */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALDST;
    DMA_InitStruct.DMA_MemoryBaseAddr = NULL;
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_HALFWORD;
    DMA_InitStruct.DMA_BufferSize = 0;
    DMA_InitStruct.DMA_PeripheralBaseAddr = (uint32_t)&(TMR2->CC1);
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_HALFWORD;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_VERYHIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_NORMAL;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA1_Channel5, &DMA_InitStruct);
    
    /* enable DMA transfer complete interrupt */
    DMA_INTConfig(DMA1_Channel5, DMA_INT_TC, ENABLE);
    
    /* disable DMA1 channel5 */
    DMA_ChannelEnable(DMA1_Channel5, DISABLE);
    
    /* initialize DMA1 channel7 --> TMR2_CH2 */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALDST;
    DMA_InitStruct.DMA_MemoryBaseAddr = NULL;
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_HALFWORD;
    DMA_InitStruct.DMA_BufferSize = 0;
    DMA_InitStruct.DMA_PeripheralBaseAddr = (uint32_t)&(TMR2->CC2);
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_HALFWORD;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_VERYHIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_NORMAL;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA1_Channel7, &DMA_InitStruct);
    
    /* enable DMA transfer complete interrupt */
    DMA_INTConfig(DMA1_Channel7, DMA_INT_TC, ENABLE);
    
    /* disable DMA1 channel7 */
    DMA_ChannelEnable(DMA1_Channel7, DISABLE);
}

