AixcelStudio/Aixcel_Mini_Drive_Board/Aixcel_Mini_Drive_Board_HW_Check/AT32F403ACGT7_IAR/Src/hwconf.c
void System_ADC1_Init(void)
{
    /* enable GPIOA clock */
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOA, ENABLE);
    
    /* enable ADC clock */
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_ADC1, ENABLE);
    
    /* config ADC clock */
    RCC_ADCCLKConfig(RCC_APB2CLK_Div8);
    
    /* config the GPIO as analog mode */
    gpio_init(MCU_AIO1_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, MCU_AIO1_Pin);
    gpio_init(MCU_AIO2_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, MCU_AIO2_Pin);
    
    ADC_InitType ADC_InitStruct;
    
    ADC_InitStruct.ADC_Mode = ADC_Mode_Independent;           /* ADC mode config */
    ADC_InitStruct.ADC_ContinuousMode = ENABLE;               /* ADC continuous function enable */
    ADC_InitStruct.ADC_ScanMode = ENABLE;                     /* ADC scan function enable */
    ADC_InitStruct.ADC_ExternalTrig = ADC_ExternalTrig_None;  /* ADC trigger config */
    ADC_InitStruct.ADC_NumOfChannel = ADC_Convertion_CNT;                      /* ADC channel length config */
    ADC_InitStruct.ADC_DataAlign = ADC_DataAlign_Right;       /* ADC data alignment config */
    
    ADC_Init(ADC1, &ADC_InitStruct);
    
    /* ADC regular channel config */ 
    ADC_RegularChannelConfig(ADC1, ADC_Channel_8, 0, ADC_SampleTime_239_5);  
    ADC_RegularChannelConfig(ADC1, ADC_Channel_9, 1, ADC_SampleTime_239_5);   
    
    ADC_ExternalTrigConvCtrl(ADC1, ENABLE);

    /* ADC DMA function enable */
    ADC_DMACtrl(ADC1, ENABLE);
    /* enable ADC interface */
    ADC_Ctrl(ADC1, ENABLE);
    Delay_ms(1);
    /* ADC calibration and reset calibration */
    ADC_RstCalibration(ADC1);
    ADC_StartCalibration(ADC1);

    /* ADC software trigger enable */
    ADC_SoftwareStartConvCtrl(ADC1, ENABLE);
    
    /**************************************************************************/
    
    /* ADC_DMA_channel configuration */
    DMA_InitType DMA_InitStruct;
    
    /* ADC DMA_channel configuration */
    DMA_Reset(DMA1_Channel1);
    
    /* initialize DMA single data mode */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALSRC;
    DMA_InitStruct.DMA_MemoryBaseAddr = (uint32_t)(ADC_Convertion_Value);
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_HALFWORD;
    DMA_InitStruct.DMA_BufferSize = ADC_Convertion_CNT;
    DMA_InitStruct.DMA_PeripheralBaseAddr = (uint32_t)&(ADC1->RDOR);
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_HALFWORD;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_HIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_CIRCULAR;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA1_Channel1, &DMA_InitStruct);
  
    /* enable DMA channel */
    DMA_ChannelEnable(DMA1_Channel1, ENABLE);
}
#endif

#ifdef SPI1_ENABLE
void System_SPI1_Init(uint32_t baud_rate)
{
    SPI_InitType SPI_InitStruct;
    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOA, ENABLE);
    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_SPI1, ENABLE);
    
    /* SPI1 GPIO config: NSS/PA4, SCK/PA5, MOSI/PA7 */
    gpio_init(SPI1_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, SPI1_CS_Pin);
    gpio_init(SPI1_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, SPI1_SCK_Pin);
    gpio_init(SPI1_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, SPI1_MOSI_Pin);
    /* SPI1 GPIO config: MISO/PA6 */
    gpio_init(SPI1_GPIO_Port, GPIO_Mode_IN_FLOATING, GPIO_MaxSpeed_50MHz, SPI1_MISO_Pin);
    
    /* Deinitializes the SPIx peripheral */
    SPI_I2S_Reset(SPI1);
    
    /* SPI1 parameter config */
    SPI_DefaultInitParaConfig(&SPI_InitStruct);
    
    SPI_InitStruct.SPI_TransMode        = SPI_TRANSMODE_FULLDUPLEX;
    SPI_InitStruct.SPI_Mode             = SPI_MODE_MASTER;
    SPI_InitStruct.SPI_FrameSize        = SPI_FRAMESIZE_8BIT;
    SPI_InitStruct.SPI_CPOL             = SPI_CPOL_HIGH;
    SPI_InitStruct.SPI_CPHA             = SPI_CPHA_2EDGE;
    SPI_InitStruct.SPI_NSSSEL           = SPI_NSSSEL_SOFT;
    SPI_InitStruct.SPI_MCLKP            = SPI_MCLKP_16;     //SPI1挂在APB2上, AT32F403A的APB2配置时钟频率120MHz, 16分频会得到7.5MHz, lsm6dsl的SPI主频最高到10MHz
    SPI_InitStruct.SPI_FirstBit         = SPI_FIRSTBIT_MSB;
    SPI_Init(SPI1, &SPI_InitStruct);
    
    SPI_Enable(SPI1, ENABLE);
}
#endif

#ifdef SPI2_ENABLE
void System_SPI2_Init(uint32_t baud_rate)
{
    SPI_InitType SPI_InitStruct;
    
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOB, ENABLE);
    
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_SPI2, ENABLE);
    
    /* SPI2 GPIO config: NSS/PB12, SCK/PB13, MOSI/PB15 */
    gpio_init(SPI2_GPIO_Port, GPIO_Mode_OUT_PP, GPIO_MaxSpeed_50MHz, SPI2_CS_Pin);
    gpio_init(SPI2_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, SPI2_SCK_Pin);
    gpio_init(SPI2_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, SPI2_MOSI_Pin);
    /* SPI2 GPIO config: MISO/PB14 */
    gpio_init(SPI2_GPIO_Port, GPIO_Mode_IN_FLOATING, GPIO_MaxSpeed_50MHz, SPI2_MISO_Pin);

    /* Deinitializes the SPIx peripheral */
    SPI_I2S_Reset(SPI2);
    
    /* SPI2 parameter config */
    SPI_DefaultInitParaConfig(&SPI_InitStruct);
    
    SPI_InitStruct.SPI_TransMode        = SPI_TRANSMODE_FULLDUPLEX;
    SPI_InitStruct.SPI_Mode             = SPI_MODE_MASTER;
    SPI_InitStruct.SPI_FrameSize        = SPI_FRAMESIZE_8BIT;
    SPI_InitStruct.SPI_CPOL             = SPI_CPOL_HIGH;
    SPI_InitStruct.SPI_CPHA             = SPI_CPHA_2EDGE;
    SPI_InitStruct.SPI_NSSSEL           = SPI_NSSSEL_SOFT;
    SPI_InitStruct.SPI_MCLKP            = SPI_MCLKP_4;     //SPI2挂在APB1上, AT32F403A的APB2配置时钟频率120MHz, 4分频会得到30MHz, GD25Q127CSIG的SPI读取速率最高可到80MHz
    SPI_InitStruct.SPI_FirstBit         = SPI_FIRSTBIT_MSB;
    SPI_Init(SPI2, &SPI_InitStruct);
    
    SPI_Enable(SPI2, ENABLE);
}
#endif

#ifdef I2C1_ENABLE
void System_I2C1_Init(uint32_t baud_rate)
{
    /* enable GPIO clock */
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOB, ENABLE);

    /* enable I2C clock */
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_I2C1, ENABLE);
    
