AixcelStudio/Aixcel_Mini_Drive_Board/Aixcel_Mini_Drive_Board_HW_Check/AT32F403ACGT7_IAR/Src/hwconf.c
    return CAN_OperatingModeRequest(can_periph, CAN_OperatingMode_Normal);
}

uint8_t System_CAN_Stop(CAN_Type* can_periph)
{
    return CAN_OperatingModeRequest(can_periph, CAN_OperatingMode_Initialization);
}

#ifdef WWDG_ENABLE
void System_WWDG_Init(void)
{
    /* enable WWDGT clock */
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_WWDG, ENABLE);
    
    /*
     *  set WWDGT clock = (PCLK1 (100MHz)/4096)/8 = 3051Hz (~327 us)
     *  set counter value to 127
     *  set window value to 127
     *  refresh window is: ~327 * (127-127)= 0ms < refresh window < ~327 * (127-63) =20.9ms.
     */
    WWDG_SetPrescaler(WWDG_Psc_8);
    WWDG_SetCounter(127);
    WWDG_SetWindowCounter(127);
    WWDG_Enable(127);
}
#else
void System_WWDG_Init(void)
{
    ;
}
#endif

void System_WWDG_Disable(void)
{
    WWDG_SetCounter(127);
    
    /* disable WWDG clock */
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_WWDG, DISABLE);
}

void EXTI3_IRQ_Callback(void)
{
    ;
}

void EXTI4_IRQ_Callback(void)
{
    ;
}

void EXTI7_IRQ_Callback(void)
{
  #if 0
    if(System_Key_Down_Flag == false)
    {
        System_Key_Down_Flag = true;
        
        System_Key_Down_Record_Time = Systick_Get();
        
        /* configure key EXTI line */
        exti_init(EXTI_Line7, EXTI_Mode_Interrupt, EXTI_Trigger_Rising, ENABLE);
    }
    else
    {
        System_Key_Down_Flag = false;
        
        if(Systick_Get() - System_Key_Down_Record_Time > 1000)
        {
            if(System_Power_Flag == false)
            {
                System_Power_Flag = true;
            }
            else
            {
                System_Power_Flag = false;
            }
        }
        
        /* configure key EXTI line */
        exti_init(EXTI_Line7, EXTI_Mode_Interrupt, EXTI_Trigger_Falling, ENABLE);
    }
  #endif
}

void EXTI15_10_IRQ_Callback(void)
{
    ;
}

bool System_Power_Flag_Get(void)
{
    return System_Power_Flag;
}
